app/Controllers/BristyController.php

SELECT *
FROM `bristy`
ORDER BY `id` DESC
---
    public function fetchbristy()
    {
        $view = new BristyModel();
        $data['view'] = $view->orderBy('id', 'DESC')->findAll();