app/Controllers/MealController.php

SELECT *
FROM `meal`
WHERE `m_id` = '11'
 LIMIT 1
---
    public function Edit($meal_id = null)
    {
        $view = new MealModel();
        $data['meal'] = $view->where('m_id', $meal_id)->first();