app/Controllers/MemberAdd.php

    public function fetchmember()
    {
        $member = new UserModel();
        $data['member'] = $member->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `member`
ORDER BY `id` DESC