app/Controllers/PayController.php

SELECT *
FROM `member`
ORDER BY `id` DESC
---
    public function index()
    {
        $user = new UserModel;
        $data['member'] = $user->orderBy('id', 'DESC')->findAll();