app/Controllers/ReportsController.php

    public function Edit($member_id = null)
    {
        $member = new UserModel();
        $data['memberI'] = $member->join('meal','member.id = meal.member_id')
        ->where('id', $member_id)->first();

        $member = new UserModel();
		$data['memberSum'] = $member->get()->getNumRows();

        $meal = new MealModel();
        $result = $meal->select('sum(bfast + lunch + dinner) as sumQuantities')->first();
		$data['mealSum'] = $result['sumQuantities'];

        $meal = new MealModel();
        $result = $meal->select('sum(bfast + lunch + dinner) as sumQuantities')->where('member_id', $member_id)->first();
		$data['meal_I'] = $result['sumQuantities'];

        $deposite = new DepositeModel();
        $result = $deposite->select('sum(price) as sumQuantities')->first();
		$data['depSum'] = $result['sumQuantities'];

        $deposite = new DepositeModel();
        $result = $deposite->select('sum(price) as sumQuantities')->where('member_id', $member_id)->first();
		$data['dep_I'] = $result['sumQuantities'];

        $rent = new RentModel();
        $result = $rent->select('sum(rent + gas + current + wifi + bua + city) as sumQuantities')->first();
		$data['rentSum'] = $result['sumQuantities'];

        $purchase = new PurcheseModel();
        $result = $purchase->select('sum(price) as sumQuantities')->first();
---
SELECT *
FROM `member`
JOIN `meal` ON `member`.`id` = `meal`.`member_id`
WHERE `id` = '11'
 LIMIT 1
SELECT *
FROM `member`
SELECT sum(bfast + lunch + dinner) as sumQuantities
FROM `meal`
WHERE `m_id` = '1'
 LIMIT 1
SELECT sum(bfast + lunch + dinner) as sumQuantities
FROM `meal`
WHERE `member_id` = '11'
 LIMIT 1
SELECT sum(price) as sumQuantities
FROM `deposite`
WHERE `member_id` = '11'
 LIMIT 1
SELECT sum(price) as sumQuantities
FROM `purchese`
WHERE `member_id` = '11'
 LIMIT 1